Simple arithmetic

In [1]:
1+1

2

Creating variables

In [3]:
x=2

In [4]:
1+x

3

Forcing an error

In [5]:
1+banana

NameError: name 'banana' is not defined

In [6]:
banana=2

In [7]:
1+banana

3

Using inbuilt functions relevant for data

In [8]:
max(1,52,3)

52

Define simple function paying close attention to the indentation that python requires

In [6]:
def add(first, second):
return first + second

IndentationError: expected an indented block (<ipython-input-6-06c86324cfe6>, line 2)

In [7]:
def add(first, second):
    return first + second

In [8]:
add(5,4)

9

Use a the pandas library - used to make tables of data called **dataframes**

In [10]:
import pandas as pd

Let's create a table of data about two great cities, London and Paris

First create lists of data, introducing them to strings vs numbers

In [12]:
cities = ['London','Paris']

In [13]:
populations = [8000000,2000000]

In [14]:
countries = ['UK','France']

Put data into a dataframe by first typing `pd.` and then tabbing to reveal stuff inside of pandas

In [21]:
df = pd.DataFrame({'city': cities, 'population':populations, 'country':countries})

In [22]:
df

     city country  population
0  London      UK     8000000
1   Paris  France     2000000

Selecting individual column of data

In [93]:
df[['city']]

     city
0  London
1   Paris

Selecting multiple columns of data

In [23]:
df[['city','country']]

     city country
0  London      UK
1   Paris  France

Find the sorting function by using tab completion and just try it

In [25]:
df.sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

Errors can be helpful it told us we were missing an argument called by. We can see this by tabbing inside the `()` yo see all the different arguments we can use

In [103]:
df.sort_values(by="population",ascending=False)

     city  population
1   Paris    15000000
0  London    10000000